In [33]:
import pandas as pd

df = pd.read_csv("calisan.csv")
df

   Id        Çalışan         Departman  Yaş     Semt  Maaş
0   1   Ahmet Yılmaz  İnsan Kaynakları   30  Kadıköy  5000
1   2     Can Ertürk       Bilgi İşlem   25    Tuzla  3000
2   3  Hasan Korkmaz          Muhasebe   45  Maltepe  4000
3   4    Cenk Saymaz  İnsan Kaynakları   50    Tuzla  3500
4   5      Ali Turan       Bilgi İşlem   23  Maltepe  2750
5   6    Rıza Ertürk          Muhasebe   34    Tuzla  6500
6   7    Mustafa Can       Bilgi İşlem   42  Kadıköy  4500

In [34]:
df["Maaş"].sum()

29250

In [35]:
df.groupby("Departman")

In [36]:
df.groupby("Departman").groups

{'Bilgi İşlem': [1, 4, 6], 'Muhasebe': [2, 5], 'İnsan Kaynakları': [0, 3]}

In [37]:
df.groupby(["Departman","Semt"]).groups

{('Bilgi İşlem', 'Kadıköy'): [6], ('Bilgi İşlem', 'Maltepe'): [4], ('Bilgi İşlem', 'Tuzla'): [1], ('Muhasebe', 'Maltepe'): [2], ('Muhasebe', 'Tuzla'): [5], ('İnsan Kaynakları', 'Kadıköy'): [0], ('İnsan Kaynakları', 'Tuzla'): [3]}

In [38]:
semtler = df.groupby("Semt")
for name,group in semtler:
    print(name)
    print(group)

Kadıköy
   Id       Çalışan         Departman  Yaş     Semt  Maaş
0   1  Ahmet Yılmaz  İnsan Kaynakları   30  Kadıköy  5000
6   7   Mustafa Can       Bilgi İşlem   42  Kadıköy  4500
Maltepe
   Id        Çalışan    Departman  Yaş     Semt  Maaş
2   3  Hasan Korkmaz     Muhasebe   45  Maltepe  4000
4   5      Ali Turan  Bilgi İşlem   23  Maltepe  2750
Tuzla
   Id      Çalışan         Departman  Yaş   Semt  Maaş
1   2   Can Ertürk       Bilgi İşlem   25  Tuzla  3000
3   4  Cenk Saymaz  İnsan Kaynakları   50  Tuzla  3500
5   6  Rıza Ertürk          Muhasebe   34  Tuzla  6500

In [39]:
departman = df.groupby("Departman")

for depart, list in departman:
    print(depart)
    print(list)

Bilgi İşlem
   Id       Çalışan    Departman  Yaş     Semt  Maaş
1   2    Can Ertürk  Bilgi İşlem   25    Tuzla  3000
4   5     Ali Turan  Bilgi İşlem   23  Maltepe  2750
6   7   Mustafa Can  Bilgi İşlem   42  Kadıköy  4500
Muhasebe
   Id        Çalışan Departman  Yaş     Semt  Maaş
2   3  Hasan Korkmaz  Muhasebe   45  Maltepe  4000
5   6    Rıza Ertürk  Muhasebe   34    Tuzla  6500
İnsan Kaynakları
   Id       Çalışan         Departman  Yaş     Semt  Maaş
0   1  Ahmet Yılmaz  İnsan Kaynakları   30  Kadıköy  5000
3   4   Cenk Saymaz  İnsan Kaynakları   50    Tuzla  3500

In [40]:
df.groupby("Semt").get_group("Kadıköy")

   Id       Çalışan         Departman  Yaş     Semt  Maaş
0   1  Ahmet Yılmaz  İnsan Kaynakları   30  Kadıköy  5000
6   7   Mustafa Can       Bilgi İşlem   42  Kadıköy  4500

In [41]:
df.groupby("Departman").sum()

                  Id  Yaş   Maaş
Departman
Bilgi İşlem       14   90  10250
Muhasebe           9   79  10500
İnsan Kaynakları   5   80   8500

In [43]:
df.groupby("Departman")["Maaş"].mean()

Departman
Bilgi İşlem         3416.666667
Muhasebe            5250.000000
İnsan Kaynakları    4250.000000
Name: Maaş, dtype: float64

In [44]:
df.groupby("Semt")["Yaş"].mean()

Semt
Kadıköy    36.000000
Maltepe    34.000000
Tuzla      36.333333
Name: Yaş, dtype: float64

In [45]:
df.groupby("Semt")["Çalışan"].count()

Semt
Kadıköy    2
Maltepe    2
Tuzla      3
Name: Çalışan, dtype: int64

In [46]:
df.groupby("Departman")["Yaş"].max()

Departman
Bilgi İşlem         42
Muhasebe            45
İnsan Kaynakları    50
Name: Yaş, dtype: int64

In [47]:
df.groupby("Departman")["Maaş"].min()

Departman
Bilgi İşlem         2750
Muhasebe            4000
İnsan Kaynakları    3500
Name: Maaş, dtype: int64

In [49]:
df.groupby("Departman")["Maaş"].max()["Muhasebe"]

6500

In [50]:
import numpy as np
df.groupby("Departman").agg(np.mean)

                        Id   Yaş         Maaş
Departman
Bilgi İşlem       4.666667  30.0  3416.666667
Muhasebe          4.500000  39.5  5250.000000
İnsan Kaynakları  2.500000  40.0  4250.000000

In [54]:
df.groupby("Departman")["Maaş"].agg([np.mean,np.min,np.max,np.sum])

                         mean  amin  amax    sum
Departman
Bilgi İşlem       3416.666667  2750  4500  10250
Muhasebe          5250.000000  4000  6500  10500
İnsan Kaynakları  4250.000000  3500  5000   8500

In [55]:
df.groupby("Departman")["Maaş"].agg([np.mean,np.min,np.max,np.sum]).loc["Muhasebe"]

mean     5250.0
amin     4000.0
amax     6500.0
sum     10500.0
Name: Muhasebe, dtype: float64